[{
	"_id": {
		"$oid": "647d29c83c1d284fd144a423"
	},
	"name": "Tempo Running",
	"duration": "30-60 minutes",
	"description": "Tempo runs are performed at a steady effort level, usually just a little slower than your 10K or half-marathon pace. These runs help to increase your anaerobic threshold, which is crucial for running faster.",
	"benefits": [
		{
			"name": "Improved Anaerobic Threshold",
			"description": "Tempo runs help increase your anaerobic threshold, allowing you to sustain a faster pace for longer durations.",
			"_id": {
				"$oid": "647d29c83c1d284fd144a424"
			}
		},
		{
			"name": "Increased Endurance",
			"description": "Regular tempo runs improve your cardiovascular fitness, enhancing your overall endurance level.",
			"_id": {
				"$oid": "647d29c83c1d284fd144a425"
			}
		}
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "647d29c83c1d284fd144a426"
	},
	"name": "Interval Training",
	"duration": "20-30 minutes",
	"description": "Interval training involves alternating between high-intensity running and recovery periods. This type of training helps improve your speed, power, and aerobic capacity.",
	"benefits": [
		{
			"name": "Enhanced Speed",
			"description": "Interval training stimulates fast-twitch muscle fibers, leading to increased speed and sprinting ability.",
			"_id": {
				"$oid": "647d29c83c1d284fd144a427"
			}
		},
		{
			"name": "Improved VO2 Max",
			"description": "By pushing your limits during intense intervals, your body adapts to improve its oxygen utilization capacity (VO2 max).",
			"_id": {
				"$oid": "647d29c83c1d284fd144a428"
			}
		}
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "647d29c83c1d284fd144a429"
	},
	"name": "Long Distance Running",
	"duration": "60+ minutes",
	"description": "Long distance running involves covering extended distances at a steady pace. It helps build endurance and prepares you for races like marathons and ultramarathons.",
	"benefits": [
		{
			"name": "Enhanced Cardiovascular Fitness",
			"description": "Long distance running improves heart health and strengthens your cardiovascular system.",
			"_id": {
				"$oid": "647d29c83c1d284fd144a42a"
			}
		},
		{
			"name": "Mental Resilience",
			"description": "Enduring long distances builds mental strength, helping you overcome challenges and maintain focus during races.",
			"_id": {
				"$oid": "647d29c83c1d284fd144a42b"
			}
		}
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "647d29c83c1d284fd144a42c"
	},
	"name": "Hill Repeats",
	"duration": "30-45 minutes",
	"description": "Hill repeats involve running uphill at a challenging intensity and then recovering on the downhill. This workout improves strength, power, and running economy.",
	"benefits": [
		{
			"name": "Increased Leg Strength",
			"description": "Running uphill develops leg muscles, including calves, hamstrings, and glutes, making you a stronger runner.",
			"_id": {
				"$oid": "647d29c83c1d284fd144a42d"
			}
		},
		{
			"name": "Improved Running Form",
			"description": "Hill repeats reinforce proper running mechanics, promoting better form and efficiency on flat terrain as well.",
			"_id": {
				"$oid": "647d29c83c1d284fd144a42e"
			}
		}
	],
	"__v": 0
},
{
	"_id": {
		"$oid": "647d29c83c1d284fd144a42f"
	},
	"name": "Fartlek Training",
	"duration": "40-60 minutes",
	"description": "Fartlek training is a mix of fast and slow running, combining steady-state running with bursts of speed. It improves both aerobic and anaerobic fitness.",
	"benefits": [
		{
			"name": "Versatility and Adaptability",
			"description": "Fartlek training helps your body adapt to different paces and intensities, making you a more versatile runner.",
			"_id": {
				"$oid": "647d29c83c1d284fd144a430"
			}
		},
		{
			"name": "Mental Engagement",
			"description": "The variable nature of fartlek training keeps you mentally engaged, making the workout more enjoyable and challenging.",
			"_id": {
				"$oid": "647d29c83c1d284fd144a431"
			}
		}
	],
	"__v": 0
}]

